Autodesk.Revit.ApplicationServices.ControlledApplication.ProjectBrowserDataChanged
# Subscribe to the ProjectBrowserDataChanged event to be notified when the ProjectBrowser data is changed.
Since:
2024

Autodesk.Revit.ApplicationServices.ControlledApplication.ExternalDataTypeServerFailureResolutionExecuting
# Subscribe to the ExternalDataTypeServerFailureResolutionExecuting event to be notified when the ExternalDataTypeServerFailureResolution is executing in Revit Document.
Since:
2023

Autodesk.Revit.ApplicationServices.ControlledApplication.ExternalDataInstanceRemovedFromDocument
# Subscribe to the ExternalDataInstanceRemovedFromDocument event to be notified when an ExternalDataInstance has been removed from Revit Document.
Since:
2023

Autodesk.Revit.ApplicationServices.ControlledApplication.ExternalDataInstanceRemovingFromDocument
# Subscribe to the ExternalDataInstanceRemovingFromDocument event to be notified when an ExternalDataInstance is being removed from Revit Document.
Since:
2023

Autodesk.Revit.ApplicationServices.ControlledApplication.ExternalDataInstanceAddedIntoDocument
# Subscribe to the ExternalDataInstanceAddedIntoDocument event to be notified when a new ExternalDataInstance has been added to Revit Document.
Since:
2023

Autodesk.Revit.ApplicationServices.ControlledApplication.ExternalDataInstanceAddingIntoDocument
# Subscribe to the ExternalDataInstanceAddingIntoDocument event to be notified when a new ExternalDataInstance is being added to Revit Document.
Since:
2023

Autodesk.Revit.ApplicationServices.ControlledApplication.DocumentReloadedLatest
Subscribe to the DocumentReloadedLatestEventArgs event to be notified immediately after Revit has finished reloading a document with central model.
Remarks:
This event is raised immediately after Revit has finished reloading latest changes from a central model.
It is raised even when document reloading latest changes from a central model failed or was cancelled(during DocumentReloadingLatest event)
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' field in the event's argument to see whether the action itself was successful or not.
This event is not cancellable, for the process of synchronizing a document with central model has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2021

Autodesk.Revit.ApplicationServices.ControlledApplication.DocumentReloadingLatest
Subscribe to the DocumentReloadingLatestEventArgs event to be notified when Revit is just about to reload latest changes from a central model.
Remarks:
This event is raised when Revit is just about to reload latest changes from a central model.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read - only mode.
Event is cancellable. To cancel it, call the 'Cancel()' method in event's argument to True.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save .Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another Autodesk.Revit.ApplicationServices.Application.DocumentReloadingLatest event will be raised immediately after document synchronizing with central model
is finished.
Since:
2021

Autodesk.Revit.ApplicationServices.ControlledApplication.SendAdpData(Autodesk.Revit.DB.AddInId,Autodesk.Revit.DB.Document,Autodesk.ADPDesktopSDK.Facets.Core)
Sends ADP Core facet with analytics data, DB::AddInId and DB::Document to the Revit for processing and sending to the ADP data lake.
addInId: DB::AddInId addInId with data for collection
document: DB::Document document with data for collection
coreFacet: Container for analytics data
Throws Autodesk.Revit.Exceptions.ArgumentNullException: A non-optional argument was NULL
Since: 2022

Autodesk.Revit.ApplicationServices.ControlledApplication.SendAdpData(Autodesk.Revit.DB.Document,Autodesk.ADPDesktopSDK.Facets.Core)
Sends ADP Core facet with analytics data, and DB::Document to the Revit for processing and sending to the ADP data lake.
document: DB::Document addInId with data for collection
coreFacet: Container for analytics data
Throws Autodesk.Revit.Exceptions.ArgumentNullException: A non-optional argument was NULL
Since: 2022

Autodesk.Revit.ApplicationServices.ControlledApplication.SendAdpData(Autodesk.Revit.DB.AddInId,Autodesk.ADPDesktopSDK.Facets.Core)
Sends ADP Core facet with analytics data, and DB::AddInId to the Revit for processing and sending to the ADP data lake.
addInId: DB::AddInId addInId with data for collection
coreFacet: Container for analytics data
Throws Autodesk.Revit.Exceptions.ArgumentNullException: A non-optional argument was NULL
Since: 2022

Autodesk.Revit.ApplicationServices.ControlledApplication.SendAdpData(Autodesk.ADPDesktopSDK.Facets.Core)
Sends ADP Core facet with analytics data to the Revit for processing and sending to the ADP data lake.
coreFacet: Container for analytics data
Throws Autodesk.Revit.Exceptions.ArgumentNullException: A non-optional argument was NULL
Since: 2022

Autodesk.Revit.ApplicationServices.ControlledApplication.IsJournalPlaying
Determines if the application is currently in journal playback mode.
Remarks:
Determines if Revit is in the process of playing back a journal. It can be
used to help prevent any user interaction that  may cause issues during playback.
For more information on Revit's journaling features contact the Autodesk Developer Network.
Returns:
true if a journal is currently playing back, false otherwise.
Since:
2020

Autodesk.Revit.ApplicationServices.ControlledApplication.ProjectBrowserDataChanged
Subscribe to the ProjectBrowserDataChanged event to be notified when the ProjectBrowser data is changed.
Since:
2024

Autodesk.Revit.ApplicationServices.ControlledApplication.ExternalDataTypeServerFailureResolutionExecuting
Subscribe to the ExternalDataTypeServerFailureResolutionExecuting event to be notified when the ExternalDataTypeServerFailureResolution is executing in Revit Document.
Since:
2023

Autodesk.Revit.ApplicationServices.ControlledApplication.ExternalDataInstanceRemovedFromDocument
Subscribe to the ExternalDataInstanceRemovedFromDocument event to be notified when an ExternalDataInstance has been removed from Revit Document.
Since:
2023

Autodesk.Revit.ApplicationServices.ControlledApplication.ExternalDataInstanceRemovingFromDocument
Subscribe to the ExternalDataInstanceRemovingFromDocument event to be notified when an ExternalDataInstance is being removed from Revit Document.
Since:
2023

Autodesk.Revit.ApplicationServices.ControlledApplication.ExternalDataInstanceAddedIntoDocument
Subscribe to the ExternalDataInstanceAddedIntoDocument event to be notified when a new ExternalDataInstance has been added to Revit Document.
Since:
2023

Autodesk.Revit.ApplicationServices.ControlledApplication.ExternalDataInstanceAddingIntoDocument
Subscribe to the ExternalDataInstanceAddingIntoDocument event to be notified when a new ExternalDataInstance is being added to Revit Document.
Since:
2023

Autodesk.Revit.ApplicationServices.ControlledApplication.DocumentReloadedLatest
Subscribe to the DocumentReloadedLatestEventArgs event to be notified immediately after Revit has finished reloading a document with central model.
Remarks:
This event is raised immediately after Revit has finished reloading latest changes from a central model.
It is raised even when document reloading latest changes from a central model failed or was cancelled (during DocumentReloadingLatest event).
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' field in event's argument to see whether the action itself was successful or not.
This event is not cancellable, for the process of reloading latest changes from a central model has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save .Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2021

Autodesk.Revit.ApplicationServices.ControlledApplication.DocumentReloadingLatest
Subscribe to the DocumentReloadingLatestEventArgs event to be notified when Revit is just about to reload latest changes from a central model.
Remarks:
This event is raised when Revit is just about to reload latest changes from a central model.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Event is cancellable. To cancel it, call the 'Cancel()' method in event's argument to True.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save .Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another Autodesk.Revit.ApplicationServices.Application.DocumentReloadingLatest event will be raised immediately after latest changes reloading from a central model
is finished.
Since:
2021

Autodesk.Revit.ApplicationServices.ControlledApplication.ViewsExportedByContext
Subscribe to the ViewsExportedByContext event to be notified immediately after Revit has finished exporting one or more views of the document via an export context by CustomExporter.
Remarks:
This event is raised immediately after Revit has finished exporting views of the document via an export context by CustomExporter.
It is raised even when view exporting via export context by CustomExporter failed.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' field in event's argument to see whether the action was successful or not.
This event is not cancellable, for the process of view exporting by CustomExporter has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2021

Autodesk.Revit.ApplicationServices.ControlledApplication.ViewsExportingByContext
Subscribe to the ViewsExportingByContext event to be notified when Revit is just about to export one or more views of the document via an export context by CustomExporter.
Remarks:
This event is raised when Revit is just about to export views of the document via an export context by CustomExporter.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Event is cancellable. To cancel it, call the 'Cancel()' method in event's argument to True.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another event Autodesk.Revit.ApplicationServices.Application.ViewsExportedByContext will be raised immediately after view exporting by CustomExporter
is finished.
Since:
2021

Autodesk.Revit.ApplicationServices.ControlledApplication.EnsureGatewayClientInitialized
Indicates if the Gateway client is initialized using the global endpoint or not.
Remarks:
This method will try to initialize the gateway client if the client isn't already set up.
Returns:
Returns true if the Gateway client is initialized, otherwise returns false.

Autodesk.Revit.ApplicationServices.ControlledApplication.IsCloudCollaborationAddonLoaded
Indicates if application loaded cloud addons correctly
Returns:
Returns true if application loaded cloud addons correctly
Since:
2020

Autodesk.Revit.ApplicationServices.ControlledApplication.HasWorksharedCloudModelEntitlement
Indicates if the current user has the workshared cloud model entitlement (BIM 360 Docs or Autodesk Docs Design) or not.
Returns:
Returns true if the current user has the workshared cloud model entitlement, otherwise returns false.
Since:
2019.2

Autodesk.Revit.ApplicationServices.ControlledApplication.GetCloudGUIDsByCloudModelInfo(System.String,System.String,System.String,System.String)
Gets RCM project GUID and model GUID from project id, folder id and model name.
region:
The BIM 360 Docs or Autodesk Docs account and project region.
projectId:
Project identity in BIM 360 Docs or Autodesk Docs.
folderId:
Folder identity in BIM 360 Docs or Autodesk Docs.
modelName:
Model name in BIM 360 Docs or Autodesk Docs.
Returns:
Returns a map including RCM project GUID and model GUID.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.ApplicationServices.ControlledApplication.HasBIM360Accounts
Indicates if the current login user has any BIM 360 Docs or Autodesk Docs accounts or not.
Returns:
Returns true if the current login user has any BIM 360 Docs or Autodesk Docs accounts, otherwise returns false.

Autodesk.Revit.ApplicationServices.ControlledApplication.OpenCloudCentralModel(Autodesk.Revit.DB.ModelPath,System.Boolean)
Opens a central document from cloud directly without creating a local cache
Remarks:
This method opens the document into memory but does not make it visible to the user in any way.
cloudPath:
The path to the cloud model to be opened.
doNotLoadLinks:
Whether or not loading links when opening the model
Returns:
The opened document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.CannotOpenBothCentralAndLocalException:
Cannot open the local model and the central model in the same Revit session.You can close one to open the other in the same Revit session.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied.A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The model on the Skyscraper server is being accessed by other users.
-or-
The central model is locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
Revit encountered serious errors while trying to open the central model.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.CorruptModelException:
There are too many corrupt elements to open this model.
Throws Autodesk.Revit.Exceptions.FileAccessException:
File cannot be opened in Revit LT because it was last saved in a version of Revit prior to 8.1.
-or-
File has an invalid extension.Try changing the file's extension and opening it again.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
File Not Found
Throws Autodesk.Revit.Exceptions.InsufficientResourcesException:
This computer does not have enough memory, disk space, or other necessary resource to open the model.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Open is temporarily disabled.
-or-
The document can not be opened.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Opening was canceled by the user or by an API event callback.
Throws Autodesk::Revit::Exceptions::SkyscraperServerCommunicationException:
The skyscraper central model could not be accessed
because of a network communication error.
Throws Autodesk::Revit::Exceptions::SkyscraperServerInternalException:
An internal error happened on the server, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.WrongUserException:
The local file is not owned by the current user, who therefore is not allowed to modify it.

Autodesk.Revit.ApplicationServices.ControlledApplication.OpenCloudSharedModel(System.String,System.Guid,System.Guid)
Opens a document from a cloud shared model
Remarks:
The resulting document is a local file attached to the central model in the cloud.
This method opens the document into memory but does not make it visible to the user in any way.
Internally calls openDocumentFile, so this method may throw any of the same exceptions.
region:
Account region of the model.
projectID:
The id of the project to which the model has been assigned.
modelID:
The id of the model.
Returns:
The opened document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.ApplicationServices.ControlledApplication.SendAdpData(System.String,Autodesk.Revit.DB.Document,Autodesk.Revit.DB.AddInId)
Send analytics data, i.e. create ADP event
Remarks:
This methods allows Revit inhouse addins to create ADP events for the data analytics purposes
without having to initialize ADP in the addin.
The events created by this method will appear as part of Revit session.
Attributes describing addin identity, like addin id, name, vendor id, will be added automatically.
serializedData:
JSON serialized Facet::Core.
pDocument:
Pointer to ADocument, may be nullptr
pAddIn:
Pointer to AddInId, may be nullptr
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.ApplicationServices.ControlledApplication.IsPreviewRelease
Checks whether or not the Revit is preview release version.
Returns:
True if it is preview release, false otherwise.
Since:
2020

Autodesk.Revit.ApplicationServices.ControlledApplication.CreateJournalHint(System.String,System.String)
Records a string in the journal file in the interactive session and fails on playback if recorded string is different.
stringToJournal:
The string to journal.
failureMessage:
The failure message.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.ApplicationServices.ControlledApplication.ReadRevitIniInteger(System.String,System.String,System.Int32)
Gets a setting from Revit ini file, as a integer.
iniSection:
The section in the ini file where the setting is declared.
iniEntry:
The setting's name.
nDefaultValue:
The default value when no setting was found.
Returns:
The value of the setting or the default value if no setting was found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.ApplicationServices.ControlledApplication.WriteRevitIniString(System.String,System.String,System.String)
Writes a setting to Revit ini file, as a string.
iniSection:
The section in the ini file where the setting is to be declared.
iniEntry:
The setting's name.
iniValue:
The setting's value.
Returns:
True if the write was successful.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.ApplicationServices.ControlledApplication.ReadRevitIniString(System.String,System.String)
Gets a setting from Revit ini file, as a string.
iniSection:
The section in the ini file where the setting is declared.
iniEntry:
The setting's name.
Returns:
The value of the setting or an empty string is no setting was found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.ApplicationServices.ControlledApplication.GetIniVarString(System.String,System.String)
Gets a setting from an ini file, as a string.
iniSection:
The section in the ini file where the setting is declared.
iniEntry:
The setting's name.
Returns:
The value of the setting or an empty string is no setting was found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.ApplicationServices.ControlledApplication.IsFeatureEnabledInLaunchDarkly(System.String)
Determines if the specified feature is enabled in Launch Darkly.
strFeatureName:
The feature name you want to ask Launch Darkly about
Returns:
True if Launch Darkly flag is on
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.ApplicationServices.ControlledApplication.IsDebugModeSet(System.String)
Determines if the specified debug mode is set.
modeName:
The debug mode name.
Returns:
True if the debug mode is set, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.ApplicationServices.ControlledApplication.OpenDocumentFile(System.String)
Opens a document from disk.
Remarks:
This method opens the document into memory but does not make it visible to the user in any way.
fileName:
The file to be opened.
Returns:
The opened document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The fileName to be opened is empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.CannotOpenBothCentralAndLocalException:
Cannot open the local model and the central model in the same Revit session. You can close one to open the other in the same Revit session.
Throws Autodesk.Revit.Exceptions.CentralModelException:
Revit encountered serious errors while trying to open the central model.
Throws Autodesk.Revit.Exceptions.CorruptModelException:
There are too many corrupt elements to open this model.
Throws Autodesk.Revit.Exceptions.FileAccessException:
File cannot be opened in Revit LT because it was last saved in a version of Revit prior to 8.1.
-or-
File has an invalid extension. Try changing the file's extension and opening it again.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
The fileName to be opened doesn't exist.
-or-
File Not Found
Throws Autodesk.Revit.Exceptions.InsufficientResourcesException:
This computer does not have enough memory, disk space, or other necessary resource to open the model.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Open is temporarily disabled.
-or-
The document can not be opened.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Opening was canceled by the user or by an API event callback.
Since:
2013

Autodesk.Revit.ApplicationServices.ControlledApplication.OpenDocumentFile(Autodesk.Revit.DB.ModelPath,Autodesk.Revit.DB.OpenOptions,Autodesk.Revit.DB.IOpenFromCloudCallback)
Opens a document from disk or cloud.
Remarks:
This method opens the document into memory but does not make it visible to the user in any way.
If the user currently has ownership of elements in this model and there is no local model on this machine,
Revit will post a warning.
modelPath:
The file to be opened.
openOptions:
Options for opening the file.
openFromCloudCallback:
The interface implementation to use when opening a cloud document. Only used for opening cloud model.
Returns:
The opened document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The modelPath to be opened is empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.CannotOpenBothCentralAndLocalException:
Cannot open the local model and the central model in the same Revit session. You can close one to open the other in the same Revit session.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The model on the RevitServer is being accessed by other users.
-or-
The central model is locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
Revit encountered serious errors while trying to open the central model.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.CorruptModelException:
There are too many corrupt elements to open this model.
Throws Autodesk.Revit.Exceptions.FileAccessException:
File cannot be opened in Revit LT because it was last saved in a version of Revit prior to 8.1.
-or-
File has an invalid extension. Try changing the file's extension and opening it again.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
The modelPath to be opened doesn't exist.
-or-
File Not Found
Throws Autodesk.Revit.Exceptions.InsufficientResourcesException:
This computer does not have enough memory, disk space, or other necessary resource to open the model.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Open is temporarily disabled.
-or-
The cloud model is not saved in current release of Revit.
-or-
The model is not allowed to access.
-or-
The document can not be opened.
-or-
Revit cannot save the transmitted model as a new central because it is already opened.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Opening was canceled by the user or by an API event callback.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the cloud model.
Throws Autodesk.Revit.Exceptions.WrongUserException:
The local file is not owned by the current user, who therefore is not allowed to modify it.
Since:
2019

Autodesk.Revit.ApplicationServices.ControlledApplication.OpenDocumentFile(Autodesk.Revit.DB.ModelPath,Autodesk.Revit.DB.OpenOptions)
Opens a document from disk or cloud.
Remarks:
This method opens the document into memory but does not make it visible to the user in any way.
If the user currently has ownership of elements in this model and there is no local model on this machine,
Revit will post a warning.
modelPath:
The file to be opened.
openOptions:
Options for opening the file.
Returns:
The opened document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The modelPath to be opened is empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.CannotOpenBothCentralAndLocalException:
Cannot open the local model and the central model in the same Revit session. You can close one to open the other in the same Revit session.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The model on the RevitServer is being accessed by other users.
-or-
The central model is locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
Revit encountered serious errors while trying to open the central model.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.CorruptModelException:
There are too many corrupt elements to open this model.
Throws Autodesk.Revit.Exceptions.FileAccessException:
File cannot be opened in Revit LT because it was last saved in a version of Revit prior to 8.1.
-or-
File has an invalid extension. Try changing the file's extension and opening it again.
-or-
File was saved by an application that was not developed or licensed by Autodesk.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
The modelPath to be opened doesn't exist.
-or-
File Not Found
Throws Autodesk.Revit.Exceptions.InsufficientResourcesException:
This computer does not have enough memory, disk space, or other necessary resource to open the model.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Open is temporarily disabled.
-or-
The cloud model is not saved in current release of Revit.
-or-
The model is not allowed to access.
-or-
The document can not be opened.
-or-
Revit cannot save the transmitted model as a new central because it is already opened.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Opening was canceled by the user or by an API event callback.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the cloud model.
Throws Autodesk.Revit.Exceptions.WrongUserException:
The local file is not owned by the current user, who therefore is not allowed to modify it.
Since:
2013

Autodesk.Revit.ApplicationServices.ControlledApplication.GetWorksharingCentralGUID(Autodesk.Revit.DB.ServerPath)
Gets the worksharing central GUID of the given server-based model.
Remarks:
The given server-based model saved in a release prior to Revit 2013 did not have this GUID.
Only the given server-based model saved in Revit 2013 or later will be able to provide this value.
serverModelPath:
The server-based model path.
Returns:
The worksharing central GUID.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.CentralModelException:
The central model is missing.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
Thrown when the given model is not created in Revit 2013 or later release.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Since:
2013

Autodesk.Revit.ApplicationServices.ControlledApplication.CopyModel(Autodesk.Revit.DB.ModelPath,System.String,System.Boolean)
Copies an existing model to a new file. Overwriting a file of the same name is allowed.
sourceModelPath:
The path of the file-based or server-based source model.
destFilePath:
The path of the destination file.
overwrite:
True if the destination file can be overwritten; otherwise, false.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given path sourceModelPath is a cloud path which is not supported in this method.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelException:
The central model is missing.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.DirectoryNotFoundException:
Thrown when the directory of destination file doesn't exist.
Throws Autodesk.Revit.Exceptions.FileArgumentAlreadyExistsException:
The destination file exists and can't be overwritten.
-or-
destFilePath is pointing to a folder that already exists and cannot be deleted.
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The Revit model specified by sourceModelPath doesn't exist.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The destination file name includes one or more invalid characters.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Since:
2012

Autodesk.Revit.ApplicationServices.ControlledApplication.SetLibraryPaths(System.Collections.Generic.IDictionary{System.String,System.String})
Sets path information identifying where Revit searches for content.
Remarks:
The map that
is returned should contain a key that is purpose of the path, such as Material Libraries and the value
in the map is the fully qualified path to be used for that search path.
paths:
The map of library paths.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.ApplicationServices.ControlledApplication.SetSystemsAnalysisWorkflows(System.Collections.Generic.IDictionary{System.String,System.String})
Sets name and path information identifying systems analysis workflow files.
Remarks:
The map should be specified as a key that is the name of the systems analysis workflow,
and a value that is the path to the workflow file.
paths:
The map of systems analysis workflows.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2020.1

Autodesk.Revit.ApplicationServices.ControlledApplication.GetSystemsAnalysisWorkflows
Returns name and path information identifying systems analysis workflow files.
Remarks:
The map that is returned contains a key that is the name of the systems analysis workflow,
and the value is the path to the workflow file.
Returns:
The map of systems analysis workflows.
Since:
2020.1

Autodesk.Revit.ApplicationServices.ControlledApplication.GetSystemsAnalysisWorkflowNames
Returns names for systems analysis workflows.
Remarks:
The array that is returned contains the name of the systems analysis workflow,
in the order they are specified in Options.
Returns:
An array of names of systems analysis workflows.
Since:
2020.1

Autodesk.Revit.ApplicationServices.ControlledApplication.WriteJournalComment(System.String,System.Boolean)
Writes a comment to the Revit journal file.
comment:
Text for journal comment.
timeStamp:
If a time stamp should be included in the journal comment.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.ApplicationServices.ControlledApplication.RegisterFailuresProcessor(Autodesk.Revit.DB.IFailuresProcessor)
Replaces Revit's default user interface (if present) with alternative handling for all warnings and errors
(including those not generated by your application) for the rest of the Revit session;
if your application is not prepared to respond to all warnings and errors,
consider use of IFailuresPreprocessor (in your opened Transaction)
or the FailuresProcessing event instead of this interface.
Remarks:
If there is previously registered Failures Processor, it gets discarded.
If you opt to register a FailuresProcessor for Revit, your processor will become the default error handler
for all Revit errors for the session. The standard Revit error dialog will not appear.
processor:
Instance of Failures Processor to be used by the Revit Application.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.ApplicationServices.ControlledApplication.OpenIFCDocument(System.String,Autodesk.Revit.DB.IFC.IFCImportOptions)
Opens an IFC document from disk using custom options.
fileName:
The IFC file to be opened.
importOptions:
The options for this import.
Returns:
The newly created document containing the IFC file.
Throws Autodesk.Revit.Exceptions.ArgumentException:
If 'fileName' is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
If the file specified by 'fileName' cannot be found.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
If Revit is missing document templates or if the file cannot be opened.
Since:
2015

Autodesk.Revit.ApplicationServices.ControlledApplication.OpenIFCDocument(System.String)
Opens an IFC document from disk using default options.
fileName:
The IFC file to be opened.
Returns:
The newly created document containing the IFC file.
Throws Autodesk.Revit.Exceptions.ArgumentException:
If 'fileName' is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
If null is passed as 'fileName'
-or-
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
If the file specified by 'fileName' cannot be found.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
If Revit is missing document templates or if the file cannot be opened.

Autodesk.Revit.ApplicationServices.ControlledApplication.BackgroundColor
The background color to use for model views in this session.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The backgroundColor argument does not represent a valid color.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2016

Autodesk.Revit.ApplicationServices.ControlledApplication.CurrentRevitServerAccelerator
Current Revit Server accelerator.
Remarks:
Revit connects with Revit Server hosts via current Revit Server accelerator.
If current Revit Server accelerator is not set, this will be an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The server name can not be used to construct a well formed Uri string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: When setting the value, Revit failed to write current Revit Server accelerator to the user environment.
Since:
2013

Autodesk.Revit.ApplicationServices.ControlledApplication.IsInfrastructureEnabled
Checks whether or not infrastructure discipline is enabled, and enable or disable it.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The current product type is not ProductType.Revit and discipline controls are not enabled.
Since:
2021.1

Autodesk.Revit.ApplicationServices.ControlledApplication.IsRouteAnalysisEnabled
Checks whether or not route analysis is enabled, and enable or disable it.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The current product type is not ProductType.Revit and discipline controls are not enabled.
Since:
2020

Autodesk.Revit.ApplicationServices.ControlledApplication.ShowGraphicalOpenEndsAreaBasedLoadBoundaryDisconnects
Whether or not to show the graphical open ends for Area Based Load Boundary disconnects.
Since:
2023

Autodesk.Revit.ApplicationServices.ControlledApplication.SystemsAnalysisWorkfilesRootPath
Root path for systems analysis workfiles
Since:
2020

Autodesk.Revit.ApplicationServices.ControlledApplication.PostInHouseDbgInfo(System.String,System.String,System.String,System.Int32,System.String)
Records a message in the journal file.

Autodesk.Revit.ApplicationServices.ControlledApplication.PostInHouseDbgWarn(System.String,System.String,System.String,System.Int32,System.String)
Posts a user-visible warning (when UI is present and runs in the in-house mode) or just records it in the journal file otherwise.